# 7.1 데이터 합치기

## 7.1.1 데이터베이스 스타일로 DataFrame 합치기

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                'data1': range(7)})

In [3]:
df2 = DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

In [4]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [5]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [9]:
pd.merge(df1 ,df2) # 어떤 칼럼으로 병합할 것인지 명시하지 않아도 작동함, 허나 지정해 주는것을 습관들이자.

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [10]:
pd.merge(df1 ,df2, on = 'key') # 기준 칼럼을 on으로 지정

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [12]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                'data1': range(7)})

In [13]:
df4 = DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [14]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey') # 두 객체에 공통되는 칼럼이름이 없다면 따로 지정해줌

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

### merge 함수는 교집합인 결과를 반환해준다.

In [16]:
pd.merge(df1, df2, how='outer') # how인자로 outer(완전외부조인)하면 합집합의 결과를 가져올 수 있다.

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0